# Number Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LoadCase..::..Number Property
LoadCase Class See Also
---
Returns unique load case number.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int Number { get; set; }
```

Visual Basic
---
```text
Public Property Number As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Number {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given number is not unique. |

# See Also
LoadCase Class
Autodesk.Revit.DB.Structure Namespace